Tekla Open API Reference for Tekla Structures 2025
PluginSymbolVisiblityAttribute Constructor
Overload List
Name | Description
PluginSymbolVisiblityAttribute(Int32)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
PluginSymbolVisiblityAttribute(PluginBase.SymbolVisibility)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
Top
See Also
Reference
PluginSymbolVisiblityAttribute Class
Tekla.Structures.Plugins Namespace